BAS BMEKZU Project/src/Documents/СМС_ДисконтированиеФинансовойПомощи/СМС_ДисконтированиеФинансовойПомощи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СМС_ДисконтированиеФинансовойПомощи</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетФинПомощи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаФинПомощи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВДнях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетФинПомощьДисконт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.СМС_ВидыОперацииДокументаДисконтирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяНеоперационныхРасходов</name>
    <type>
      <types>CatalogRef.СтатьиНеоперационныхРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаДисконтирования</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонца</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КвоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыдачаФинПомощи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратФинПомощи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстСрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачБаза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачОстДт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачОстКт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонОстДт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонОстКт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыДоход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Enums/СМС_ВидыОперацииДокументаДисконтирования/СМС_ВидыОперацииДокументаДисконтирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СМС_ВидыОперацииДокументаДисконтирования</name>
  <enumValues>
    <name>Выдача</name>
  </enumValues>
  <enumValues>
    <name>Получение</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/СМС_ДисконтированиеФинансовойПомощи/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

//-----------------------------------------------------------------------------

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Выдача финансовой помощи
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВыдачаФинПомощи";
	КомандаПечати.Представление = НСтр("ru='Выдача финансовой помощи';uk='Видача фінансової допомоги'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
			
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьСоответствиеВидовОперацийФормам() Экспорт

	ФормыСМС_ДисконтированиеФинансовойПомощи = Новый Соответствие;
	ФормыСМС_ДисконтированиеФинансовойПомощи.Вставить(Перечисления.СМС_ВидыОперацииДокументаДисконтирования.Выдача,    "ФормаДокумента");
	ФормыСМС_ДисконтированиеФинансовойПомощи.Вставить(Перечисления.СМС_ВидыОперацииДокументаДисконтирования.Получение, "ФормаДокумента");
	
	Возврат ФормыСМС_ДисконтированиеФинансовойПомощи;

КонецФункции 

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВыдачаФинПомощи") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВыдачаФинПомощи", НСтр("ru='Дисконтирование';uk='Дисконтування'"), 
			ПечатьДокумента(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,"Документ.СМС_ДисконтированиеФинансовойПомощи.МакетВыдачи", , Истина);
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует табличный документ с печатной формой накладной,
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)

	УстановитьПривилегированныйРежим(Истина);
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Для каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		Если Ссылка.ВДнях Тогда
			ТабДокумент = ПечатьВыдачиФинПомощиВДнях(Ссылка, ТабДокумент, ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм);
		Иначе
			// Получить экземпляр документа на печать
			ТабДокумент = ПечатьВыдачиФинПомощи(Ссылка, ТабДокумент, ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьВыдачиФинПомощи(Ссылка, ТабДокумент, КодЯзыкаПечать)
	
	// Запрос по Шапке.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст ="ВЫБРАТЬ
	              |	СМС_ДисконтированиеФинансовойПомощи.Ссылка,
	              |	СМС_ДисконтированиеФинансовойПомощи.Номер,
	              |	СМС_ДисконтированиеФинансовойПомощи.Дата,
	              |	СМС_ДисконтированиеФинансовойПомощи.Контрагент,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента,
	              |	СМС_ДисконтированиеФинансовойПомощи.СтатьяДоходов,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДатаВыдачи,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДатаВозврата,
	              |	СМС_ДисконтированиеФинансовойПомощи.ГодовойПроцент,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДатаПериода,
	              |	СМС_ДисконтированиеФинансовойПомощи.СчетФинПомощи,
	              |	ВЫРАЗИТЬ(СМС_ДисконтированиеФинансовойПомощи.СуммаФинПомощи КАК ЧИСЛО(15, 2)) КАК СуммаФинПомощи,
	              |	СМС_ДисконтированиеФинансовойПомощи.ВДнях,
	              |	СМС_ДисконтированиеФинансовойПомощи.СчетФинПомощьДисконт,
	              |	СМС_ДисконтированиеФинансовойПомощи.Организация.НаименованиеПолное КАК ОрганизацияПолноеНаименование,
	              |	СМС_ДисконтированиеФинансовойПомощи.Контрагент.НаименованиеПолное КАК КонтрагентПолноеНаименование,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента.Номер КАК НомерДоговора,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	              |	ВЫРАЗИТЬ(СМС_ДисконтированиеФинансовойПомощи.ГодовойПроцент / 12 КАК ЧИСЛО(10, 3)) КАК ГодовойПроцентМесячный,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента.Дата КАК ДатаНачала,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента.ИНАГРО_СрокДействия КАК ДатаОкончания,
	              |	ЕСТЬNULL(СМС_ДисконтированиеФинансовойПомощи.СуммаФинПомощи, 0) - ЕСТЬNULL(ИтоговыеСуммы.ИтогПроцентыДоход, 0) КАК СуммаFV,
	              |	ИтоговыеСуммы.ИтогПроцентыРасход,
	              |	КвоСтрок.НомерСтроки КАК КоличествоСтрок,
	              |	СМС_ДисконтированиеФинансовойПомощи.ВидОперации
	              |ИЗ
	              |	Документ.СМС_ДисконтированиеФинансовойПомощи КАК СМС_ДисконтированиеФинансовойПомощи,
	              |	(ВЫБРАТЬ
	              |		МАКСИМУМ(СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НомерСтроки) КАК НомерСтроки
	              |	ИЗ
	              |		Документ.СМС_ДисконтированиеФинансовойПомощи.РасшифровкаДисконтирования КАК СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования) КАК КвоСтрок,
	              |	(ВЫБРАТЬ
	              |		СУММА(СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ПроцентыДоход) КАК ИтогПроцентыДоход,
	              |		СУММА(СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ПроцентыРасход) КАК ИтогПроцентыРасход
	              |	ИЗ
	              |		Документ.СМС_ДисконтированиеФинансовойПомощи.РасшифровкаДисконтирования КАК СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования) КАК ИтоговыеСуммы
	              |ГДЕ
	              |	СМС_ДисконтированиеФинансовойПомощи.Ссылка = &Ссылка";

	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
				"ВЫБРАТЬ
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.Ссылка,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НомерСтроки,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ДатаНачала,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ДатаКонца,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.КвоДней,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.Ставка,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ВыдачаФинПомощи,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ВозвратФинПомощи,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ПроцентыРасход,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ОстСрок,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НачБаза,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НачОстДт,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НачОстКт,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.КонОстДт,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.КонОстКт,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ПроцентыДоход
				|ИЗ
				|	Документ.СМС_ДисконтированиеФинансовойПомощи.РасшифровкаДисконтирования КАК СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования
				|ГДЕ
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.Ссылка = &Ссылка";
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СМС_ДисконтированиеФинансовойПомощи_Выдача";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СМС_ДисконтированиеФинансовойПомощи.МакетВыдачи");
	
	// печать производится на языке, указанном в настройках
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
		
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ДатаДоговора  = Формат(Шапка.ДатаДоговора, "ДЛФ=D");
	ОбластьМакета.Параметры.ДатаНачала    = Формат(Шапка.ДатаНачала,   "ДЛФ=D");
	ОбластьМакета.Параметры.ДатаОкончания = Формат(Шапка.ДатаОкончания,"ДЛФ=D");
	Если Шапка.ВидОперации = Перечисления.СМС_ВидыОперацииДокументаДисконтирования.Выдача Тогда
		ОбластьМакета.Параметры.ФинПомощь        = "Видача фін. допомоги";
		ОбластьМакета.Параметры.НачисленоНаСумму = "Нараховані витрати на суму %";
		ОбластьМакета.Параметры.Начислено        = "Нараховано дохід на суму %";
	ИначеЕсли Шапка.ВидОперации = Перечисления.СМС_ВидыОперацииДокументаДисконтирования.Получение Тогда
		ОбластьМакета.Параметры.ФинПомощь        = "Отримання фін. допомоги";
		ОбластьМакета.Параметры.НачисленоНаСумму = "Нараховано дохід на суму %";
		ОбластьМакета.Параметры.Начислено        = "Нараховано витрати на суму %";
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
		
	ЗапросТЧ.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаСтрок = ЗапросТЧ.Выполнить().Выбрать();
		
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокиЖ = Макет.ПолучитьОбласть("СтрокаЖ");
		
	ИтогВыдачаФинПомощи  = 0;
	ИтогПроцентыРасход   = 0;
	ИтогПроцентыДоход    = 0;
	ИтогВозвратФинПомощи = 0;
	Пока ВыборкаСтрок.Следующий() Цикл
			
		Если НачалоМесяца(ВыборкаСтрок.Ссылка.ДатаПериода) = НачалоМесяца(ВыборкаСтрок.ДатаНачала) Тогда
			ОбластьСтрокиЖ.Параметры.Заполнить(ВыборкаСтрок);
			ОбластьСтрокиЖ.Параметры.ДатаКонца = Формат(ВыборкаСтрок.ДатаКонца, "ДЛФ=D");
			ТабДокумент.Вывести(ОбластьСтрокиЖ);
		Иначе
			ОбластьСтроки.Параметры.Заполнить(ВыборкаСтрок);
			ОбластьСтроки.Параметры.ДатаКонца = Формат(ВыборкаСтрок.ДатаКонца, "ДЛФ=D");
			ТабДокумент.Вывести(ОбластьСтроки);
		КонецЕсли;
		ИтогВыдачаФинПомощи  = ИтогВыдачаФинПомощи + ВыборкаСтрок.ВыдачаФинПомощи;
		ИтогПроцентыРасход   = ИтогПроцентыРасход + ВыборкаСтрок.ПроцентыРасход;
		ИтогПроцентыДоход    = ИтогПроцентыДоход + ВыборкаСтрок.ПроцентыДоход;
		ИтогВозвратФинПомощи = ИтогВозвратФинПомощи + ВыборкаСтрок.ВозвратФинПомощи;
			
	КонецЦикла;
		
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.ИтогВыдачаФинПомощи  = ИтогВыдачаФинПомощи;
	ОбластьИтого.Параметры.ИтогПроцентыРасход   = ИтогПроцентыРасход;
	ОбластьИтого.Параметры.ИтогПроцентыДоход    = ИтогПроцентыДоход;
	ОбластьИтого.Параметры.ИтогВозвратФинПомощи = ИтогВозвратФинПомощи;
	
	ТабДокумент.Вывести(ОбластьИтого);
	
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьВыдачиФинПомощиВДнях(Ссылка, ТабДокумент, КодЯзыкаПечать)

	// Запрос по Шапке.
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	СМС_ДисконтированиеФинансовойПомощи.Ссылка,
	              |	СМС_ДисконтированиеФинансовойПомощи.Номер,
	              |	СМС_ДисконтированиеФинансовойПомощи.Дата,
	              |	СМС_ДисконтированиеФинансовойПомощи.Контрагент,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента,
	              |	СМС_ДисконтированиеФинансовойПомощи.СтатьяДоходов,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДатаВыдачи,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДатаВозврата,
	              |	СМС_ДисконтированиеФинансовойПомощи.ГодовойПроцент,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДатаПериода,
	              |	СМС_ДисконтированиеФинансовойПомощи.СчетФинПомощи,
	              |	ВЫРАЗИТЬ(СМС_ДисконтированиеФинансовойПомощи.СуммаФинПомощи КАК ЧИСЛО(15, 2)) КАК СуммаФинПомощи,
	              |	СМС_ДисконтированиеФинансовойПомощи.ВДнях,
	              |	СМС_ДисконтированиеФинансовойПомощи.СчетФинПомощьДисконт,
	              |	СМС_ДисконтированиеФинансовойПомощи.Организация.НаименованиеПолное КАК ОрганизацияПолноеНаименование,
	              |	СМС_ДисконтированиеФинансовойПомощи.Контрагент.НаименованиеПолное КАК КонтрагентПолноеНаименование,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента.Номер КАК НомерДоговора,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	              |	ВЫРАЗИТЬ(СМС_ДисконтированиеФинансовойПомощи.ГодовойПроцент / 12 КАК ЧИСЛО(10, 3)) КАК ГодовойПроцентМесячный,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента.Дата КАК ДатаНачала,
	              |	СМС_ДисконтированиеФинансовойПомощи.ДоговорКонтрагента.ИНАГРО_СрокДействия КАК ДатаОкончания,
	              |	ЕСТЬNULL(СМС_ДисконтированиеФинансовойПомощи.СуммаФинПомощи, 0) - ЕСТЬNULL(ИтоговыеСуммы.ИтогПроцентыДоход, 0) КАК СуммаFV,
	              |	ИтоговыеСуммы.ИтогПроцентыРасход,
	              |	КвоСтрок.НомерСтроки КАК КоличествоСтрок,
	              |	СМС_ДисконтированиеФинансовойПомощи.ВидОперации
	              |ИЗ
	              |	Документ.СМС_ДисконтированиеФинансовойПомощи КАК СМС_ДисконтированиеФинансовойПомощи,
	              |	(ВЫБРАТЬ
	              |		МАКСИМУМ(СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НомерСтроки) КАК НомерСтроки
	              |	ИЗ
	              |		Документ.СМС_ДисконтированиеФинансовойПомощи.РасшифровкаДисконтирования КАК СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования) КАК КвоСтрок,
	              |	(ВЫБРАТЬ
	              |		СУММА(СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ПроцентыДоход) КАК ИтогПроцентыДоход,
	              |		СУММА(СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ПроцентыРасход) КАК ИтогПроцентыРасход
	              |	ИЗ
	              |		Документ.СМС_ДисконтированиеФинансовойПомощи.РасшифровкаДисконтирования КАК СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования) КАК ИтоговыеСуммы
	              |ГДЕ
	              |	СМС_ДисконтированиеФинансовойПомощи.Ссылка = &Ссылка";
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
				"ВЫБРАТЬ
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.Ссылка,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НомерСтроки,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ДатаНачала,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ДатаКонца,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.КвоДней,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.Ставка,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ВыдачаФинПомощи,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ВозвратФинПомощи,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ПроцентыРасход,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ОстСрок,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НачБаза,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НачОстДт,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.НачОстКт,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.КонОстДт,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.КонОстКт,
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.ПроцентыДоход
				|ИЗ
				|	Документ.СМС_ДисконтированиеФинансовойПомощи.РасшифровкаДисконтирования КАК СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования
				|ГДЕ
				|	СМС_ДисконтированиеФинансовойПомощиРасшифровкаДисконтирования.Ссылка = &Ссылка";
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СМС_ДисконтированиеФинансовойПомощи_ВыдачаВДнях";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СМС_ДисконтированиеФинансовойПомощи.МакетВыдачиВДнях");
	
	// печать производится на языке, указанном в настройках
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
		
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ДатаДоговора  = Формат(Шапка.ДатаДоговора, "ДЛФ=D");
	ОбластьМакета.Параметры.ДатаНачала    = Формат(Шапка.ДатаНачала,   "ДЛФ=D");
	ОбластьМакета.Параметры.ДатаОкончания = Формат(Шапка.ДатаОкончания,"ДЛФ=D");
	Если Шапка.ВидОперации = Перечисления.СМС_ВидыОперацииДокументаДисконтирования.Выдача Тогда
		ОбластьМакета.Параметры.ФинПомощь        = "Видача фін. допомоги";
		ОбластьМакета.Параметры.НачисленоНаСумму = "Нараховані витрати на суму %";
		ОбластьМакета.Параметры.Начислено        = "Нараховано дохід на суму %";
	ИначеЕсли Шапка.ВидОперации = Перечисления.СМС_ВидыОперацииДокументаДисконтирования.Получение Тогда
		ОбластьМакета.Параметры.ФинПомощь        = "Отримання фін. допомоги";
		ОбластьМакета.Параметры.НачисленоНаСумму = "Нараховано дохід на суму %";
		ОбластьМакета.Параметры.Начислено        = "Нараховано витрати на суму %";
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);	
	
	ЗапросТЧ.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаСтрок = ЗапросТЧ.Выполнить().Выбрать();
		
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокиЖ = Макет.ПолучитьОбласть("СтрокаЖ");
	
	ИтогВыдачаФинПомощи  = 0;
	ИтогПроцентыРасход   = 0;
	ИтогПроцентыДоход    = 0;
	ИтогВозвратФинПомощи = 0;
	Пока ВыборкаСтрок.Следующий() Цикл
			
		Если НачалоМесяца(ВыборкаСтрок.Ссылка.ДатаПериода) = НачалоМесяца(ВыборкаСтрок.ДатаНачала) Тогда
			ОбластьСтрокиЖ.Параметры.Заполнить(ВыборкаСтрок);
			ОбластьСтрокиЖ.Параметры.ДатаКонца = Формат(ВыборкаСтрок.ДатаКонца, "ДЛФ=D");
			ТабДокумент.Вывести(ОбластьСтрокиЖ);
		Иначе
			ОбластьСтроки.Параметры.Заполнить(ВыборкаСтрок);
			ОбластьСтроки.Параметры.ДатаКонца = Формат(ВыборкаСтрок.ДатаКонца, "ДЛФ=D");
			ТабДокумент.Вывести(ОбластьСтроки);
		КонецЕсли;
		ИтогВыдачаФинПомощи  = ИтогВыдачаФинПомощи + ВыборкаСтрок.ВыдачаФинПомощи;
		ИтогПроцентыРасход   = ИтогПроцентыРасход + ВыборкаСтрок.ПроцентыРасход;
		ИтогПроцентыДоход    = ИтогПроцентыДоход + ВыборкаСтрок.ПроцентыДоход;
		ИтогВозвратФинПомощи = ИтогВозвратФинПомощи + ВыборкаСтрок.ВозвратФинПомощи;
		
	КонецЦикла;
		
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.ИтогВыдачаФинПомощи  = ИтогВыдачаФинПомощи;
	ОбластьИтого.Параметры.ИтогПроцентыРасход   = ИтогПроцентыРасход;
	ОбластьИтого.Параметры.ИтогПроцентыДоход    = ИтогПроцентыДоход;
	ОбластьИтого.Параметры.ИтогВозвратФинПомощи = ИтогВозвратФинПомощи;
	
	ТабДокумент.Вывести(ОбластьИтого);
	
	Возврат ТабДокумент;

КонецФункции 

Функция ПолучитьФиксированныйМассивВидовОпераций() Экспорт 

	МассивВидовОпераций = Новый Массив;
	СписокВидовОпераций = Новый СписокЗначений;
			
	МассивВидовОпераций.Добавить(Перечисления.СМС_ВидыОперацииДокументаДисконтирования.Выдача);
	МассивВидовОпераций.Добавить(Перечисления.СМС_ВидыОперацииДокументаДисконтирования.Получение);
	Возврат Новый ФиксированныйМассив(МассивВидовОпераций);

КонецФункции

#КонецЕсли
